Thanks for reaching out! I wasn't able to replicate this 🤔 

```
$ tf apply

Terraform used the selected providers to generate the following execution plan. Resource actions
are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # prefect_block.test_s3_cache will be created
  + resource "prefect_block" "test_s3_cache" {
      + created   = (known after apply)
      + data      = (sensitive value)
      + data_wo   = (write-only attribute)
      + id        = (known after apply)
      + name      = "test-s3-block"
      + type_slug = "s3-bucket"
      + updated   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

prefect_block.test_s3_cache: Creating...
prefect_block.test_s3_cache: Creation complete after 0s [id=34a02f17-cf20-41cb-a81c-3744ef1b3649]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Could you use the `prefect` CLI to check for that block type?

```bash
# Check if block types are registered
prefect block type ls | grep s3-bucket

# Inspect s3-bucket specifically  
prefect block type inspect s3-bucket
```

May be worth checking your server logs too to see if it had any issues auto-registering block types.